In [36]:
# pip install pandas   #command to install the pandas library

In [6]:
import numpy as np

In [7]:
import pandas as pd

In [8]:
# pd.dataframe(data,index,columns,dtype,copy)

In [9]:
a=[[1,2,3,4,5],[2,3,5,7,8]]

In [10]:
numbers_array=np.array(a)
numbers_array

array([[1, 2, 3, 4, 5],
       [2, 3, 5, 7, 8]])

In [11]:
df=pd.DataFrame(a,columns=["a","b","c","d","e"])   #columns is used to change the column names,index is used to change the row name

In [12]:
df=pd.DataFrame(a,columns=["a","b","c","d","e"], index=["first","second"])

In [13]:
print(df.info())  #We can change the data type of each and every column based on our preferences

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, first to second
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      int64
 1   b       2 non-null      int64
 2   c       2 non-null      int64
 3   d       2 non-null      int64
 4   e       2 non-null      int64
dtypes: int64(5)
memory usage: 96.0+ bytes
None

In [14]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [15]:
student_details=[{"name":"ahsan","father name":"xyz","final_marks":85,"grade":"A"},
                 {"name":"ahmed","father name":"abc","final_marks":90,"grade":"A"},
                 {"name":"sachin","father name":"pqr","final_marks":"fail","grade":"A+"},
                 {"name":"ameet","father name":"wxy","final_marks":99,"grade":"A+"},
                 {"name":"ritesh","father name":"uwv","final_marks":100,"grade":"A+"}
                ]
print(student_details)

[{'name': 'ahsan', 'father name': 'xyz', 'final_marks': 85, 'grade': 'A'}, {'name': 'ahmed', 'father name': 'abc', 'final_marks': 90, 'grade': 'A'}, {'name': 'sachin', 'father name': 'pqr', 'final_marks': 'fail', 'grade': 'A+'}, {'name': 'ameet', 'father name': 'wxy', 'final_marks': 99, 'grade': 'A+'}, {'name': 'ritesh', 'father name': 'uwv', 'final_marks': 100, 'grade': 'A+'}]

In [16]:
df2=pd.DataFrame(student_details)

In [17]:
df2

     name father name final_marks grade
0   ahsan         xyz          85     A
1   ahmed         abc          90     A
2  sachin         pqr        fail    A+
3   ameet         wxy          99    A+
4  ritesh         uwv         100    A+

In [18]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         5 non-null      object
 1   father name  5 non-null      object
 2   final_marks  5 non-null      object
 3   grade        5 non-null      object
dtypes: object(4)
memory usage: 292.0+ bytes

In [19]:
df2["final_marks"]=pd.to_numeric(df2["final_marks"],errors="coerce")
# pd.to_numeric?

In [20]:
df2

     name father name  final_marks grade
0   ahsan         xyz         85.0     A
1   ahmed         abc         90.0     A
2  sachin         pqr          NaN    A+
3   ameet         wxy         99.0    A+
4  ritesh         uwv        100.0    A+

In [21]:
df2.final_marks  #to access the particular column with it's name

0     85.0
1     90.0
2      NaN
3     99.0
4    100.0
Name: final_marks, dtype: float64

In [22]:
df2.loc[0]  #to get the particular row with it's index also we can perform slicing here

name           ahsan
father name      xyz
final_marks     85.0
grade              A
Name: 0, dtype: object

In [23]:
# df2.head  #prints the initial five rows from our data/dataset
# df2.tail    #prints the last five rows from our data/dataset

In [24]:
df

        a  b  c  d  e
first   1  2  3  4  5
second  2  3  5  7  8

In [25]:
df["f"]=df["a"]+df["c"]
df

        a  b  c  d  e  f
first   1  2  3  4  5  4
second  2  3  5  7  8  7

In [26]:
df.shape

(2, 6)

In [27]:
len(df)  # returns the no.of rows

2

In [28]:
df.size  # returns the total no.of cells (2,6)= 2*6 = 12

12

In [29]:
df2

     name father name  final_marks grade
0   ahsan         xyz         85.0     A
1   ahmed         abc         90.0     A
2  sachin         pqr          NaN    A+
3   ameet         wxy         99.0    A+
4  ritesh         uwv        100.0    A+

In [30]:
df2["class"]=pd.Series([12,11,10],index=[0,1,4]) #Series["single dimension data always"]
df2

     name father name  final_marks grade  class
0   ahsan         xyz         85.0     A   12.0
1   ahmed         abc         90.0     A   11.0
2  sachin         pqr          NaN    A+    NaN
3   ameet         wxy         99.0    A+    NaN
4  ritesh         uwv        100.0    A+   10.0

In [31]:
# pd.read_csv?

In [32]:
dataFrame=pd.read_csv("calories.csv")
# pd.head(no.of rows)

In [33]:
pd.options.display.max_rows=999999 #to print the complete rows of our dataset

In [34]:
df2.describe()   #describes the complete data on the basis of columns
# df.describe().loc["mean"]
# df.describe().loc["count"]

       final_marks  class
count     4.000000    3.0
mean     93.500000   11.0
std       7.234178    1.0
min      85.000000   10.0
25%      88.750000   10.5
50%      94.500000   11.0
75%      99.250000   11.5
max     100.000000   12.0

In [37]:
df.a.mean()

1.5

In [39]:
# d.loc["50%"]